flyghost/OneOS-V2.1.0/drivers/hal/fm/FM33G0xx_HAL/FM33G0xx_HAL_Driver/Src/fm33g0xx_anac.c
/**
  ******************************************************************************
  * @file    fm33g0xx_anac.c
  * @author  FM33g0xx Application Team
  * @version V0.3.02G
  * @date    01-21-2019
  * @brief   This file provides firmware functions to manage the following 
  *          functionalities of....:
  *
*/

/* Includes ------------------------------------------------------------------*/
#include "fm33g0xx_anac.h" 


/** @addtogroup fm33g0xx_StdPeriph_Driver
  * @{
  */

/** @defgroup ANAC 
  * @brief ANAC driver modules
  * @{
  */ 

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/

/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/

/* Private function prototypes -----------------------------------------------*/
/* Private functions ---------------------------------------------------------*/



/********************************
PDR下电复位电压配置函数
功能:下电复位电压配置
输入：配置下电复位电压（bit2:1）
输出:无
********************************/
void ANAC_PDRCON_PDRCFG_Set(uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = ANAC->PDRCON;
	tmpreg &= ~(ANAC_PDRCON_PDRCFG_Msk);
	tmpreg |= (SetValue & ANAC_PDRCON_PDRCFG_Msk);
	ANAC->PDRCON = tmpreg;
}
/********************************
读PDR下电复位寄存器位函数
功能:读PDR下电复位电压值寄存器位
输入：无
输出:PDR寄存器电压值
********************************/
uint32_t ANAC_PDRCON_PDRCFG_Get(void)
{
	return (ANAC->PDRCON & ANAC_PDRCON_PDRCFG_Msk);
}

/*********************************
PDR下电复位控制函数 
功能：PDR下电复位启停控制
输入: ENABLE 启动下电复位
      DISABLE 停止下电复位
输出: 无
*********************************/
void ANAC_PDRCON_PDREN_Setable(FunState NewState)
{
	if (NewState == ENABLE)
	{
		ANAC->PDRCON |= (ANAC_PDRCON_PDREN_Msk);
	}
	else
	{
		ANAC->PDRCON &= ~(ANAC_PDRCON_PDREN_Msk);
	}
}
/********************************
读PDR下电复位控制状态函数
功能:读PDR下电复位控制状态
输入：无
输出:ENABLE 已启动
     DISABLE 已停止
********************************/
FunState ANAC_PDRCON_PDREN_Getable(void)
{
	if (ANAC->PDRCON & (ANAC_PDRCON_PDREN_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/********************************
BOR下电复位电压配置函数
功能:下电复位电压配置
输入：配置BOR下电复位电压（bit2:1）
输出:无
********************************/
void ANAC_BORCON_BOR_PDRCFG_Set(uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = ANAC->BORCON;
	tmpreg &= ~(ANAC_BORCON_BOR_PDRCFG_Msk);
	tmpreg |= (SetValue & ANAC_BORCON_BOR_PDRCFG_Msk);
	ANAC->BORCON = tmpreg;
}

/********************************
读BOR下电复位寄存器电压值函数
功能:读BOR下电复位电压值寄存器位
输入：无
输出:BOR寄存器电压值
********************************/
uint32_t ANAC_BORCON_BOR_PDRCFG_Get(void)
{
	return (ANAC->BORCON & ANAC_BORCON_BOR_PDRCFG_Msk);
}


/*********************************
BOR下电复位控制函数 
功能：BOR下电复位启停控制
输入: ENABLE 启动下电复位
      DISABLE 停止下电复位
输出: 无
*********************************/
void ANAC_BORCON_OFF_BOR_Setable(FunState NewState)
{
	if (NewState == ENABLE)
	{
		ANAC->BORCON |= (ANAC_BORCON_OFF_BOR_Msk);
	}
	else
	{
		ANAC->BORCON &= ~(ANAC_BORCON_OFF_BOR_Msk);
	}
}
/********************************
读BOR下电复位控制状态函数
功能:读BOR下电复位控制状态
输入：无
输出:ENABLE 已启动
     DISABLE 已停止
********************************/
FunState ANAC_BORCON_OFF_BOR_Getable(void)
{
	if (ANAC->BORCON & (ANAC_BORCON_OFF_BOR_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/*********************************
SVD电源跌落中断使能控制函数 
功能：SVD电源跌落中断启停控制
输入: ENABLE 启动SVD电源跌落中断
      DISABLE 停止SVD电源跌落中断
输出: 无
*********************************/
void ANAC_SVDCFG_PFIE_Setable(FunState NewState)
{
	if (NewState == ENABLE)
	{
		ANAC->SVDCFG |= (ANAC_SVDCFG_PFIE_Msk);
	}
	else
	{
		ANAC->SVDCFG &= ~(ANAC_SVDCFG_PFIE_Msk);
	}
}
/********************************
读SVD电源跌落中断控制状态函数
功能:SVD电源跌落中断控制状态
输入：无
输出:ENABLE 已启动
     DISABLE 已停止
********************************/
FunState ANAC_SVDCFG_PFIE_Getable(void)
{
	if (ANAC->SVDCFG & (ANAC_SVDCFG_PFIE_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}
/*********************************
SVD电源恢复中断使能控制函数 
功能：SVD电源恢复中断启停控制
输入: ENABLE 启动SVD电源恢复中断
      DISABLE 停止SVD电源恢复中断
输出: 无
*********************************/
void ANAC_SVDCFG_PRIE_Setable(FunState NewState)
{
	if (NewState == ENABLE)
	{
		ANAC->SVDCFG |= (ANAC_SVDCFG_PRIE_Msk);
	}
	else
	{
		ANAC->SVDCFG &= ~(ANAC_SVDCFG_PRIE_Msk);
	}
}

/********************************
读SVD电源恢复中断控制状态函数
功能:SVD电源恢复中断控制状态
输入：无
输出:ENABLE 已启动
     DISABLE 已停止
********************************/
FunState ANAC_SVDCFG_PRIE_Getable(void)
{
	if (ANAC->SVDCFG & (ANAC_SVDCFG_PRIE_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/********************************
SVD报警阈值配置函数
功能:SVD报警阈值电压配置
输入：配置报警电压（bit7:4）
输出:无
********************************/
void ANAC_SVDCFG_SVDLVL_Set(uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = ANAC->SVDCFG;
	tmpreg &= ~(ANAC_SVDCFG_SVDLVL_Msk);
	tmpreg |= (SetValue & ANAC_SVDCFG_SVDLVL_Msk);
	ANAC->SVDCFG = tmpreg;
}
/********************************
读SVD报警阈值函数
功能:获取SVD报警阈值
输入：无
输出:SVD报警阈值
********************************/
uint32_t ANAC_SVDCFG_SVDLVL_Get(void)
{
	return (ANAC->SVDCFG & ANAC_SVDCFG_SVDLVL_Msk);
}

/********************************
SVD数字滤波控制状态函数
功能:SVD电源恢复中断控制状态
输入：ENABLE 启动数字滤波（SVDMODE=1时必须置1）
      DISABLE 停止数字滤波
输出: 无
********************************/
void ANAC_SVDCFG_DFEN_Setable(FunState NewState)
{
	if (NewState == ENABLE)
	{
		ANAC->SVDCFG |= (ANAC_SVDCFG_DFEN_Msk);
	}
	else
	{
		ANAC->SVDCFG &= ~(ANAC_SVDCFG_DFEN_Msk);
	}
}
/********************************
读SVD数字滤波控制状态函数
功能:SVD数字滤波控制状态
输入：无
输出:ENABLE 已启动
     DISABLE 已停止
********************************/
FunState ANAC_SVDCFG_DFEN_Getable(void)
{
	if (ANAC->SVDCFG & (ANAC_SVDCFG_DFEN_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/********************************
SVD工作模式选择函数
功能:SVD工作模式选择
输入：ANAC_SVDCFG_SVDMOD_INTERVAL：间歇使能模式（间歇使能模式下必须开启数字滤波）
      ANAC_SVDCFG_SVDMOD_ALWAYSON：常使能模式
输出: 无
********************************/
void ANAC_SVDCFG_SVDMOD_Set(uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = ANAC->SVDCFG;
	tmpreg &= ~(ANAC_SVDCFG_SVDMOD_Msk);
	tmpreg |= (SetValue & ANAC_SVDCFG_SVDMOD_Msk);
	ANAC->SVDCFG = tmpreg;
}
/********************************
读SVD工作模式函数
功能:读SVD工作模式
输入：无
输出:工作模式状态位
********************************/
uint32_t ANAC_SVDCFG_SVDMOD_Get(void)
{
	return (ANAC->SVDCFG & ANAC_SVDCFG_SVDMOD_Msk);
}

/********************************
SVD间歇使能间隔配置函数
功能:SVD间歇使能间隔
输入：00：15.625ms
      01：62.5ms
      10：256ms
      11：1s
输出: 无
********************************/
void ANAC_SVDCFG_SVDITVL_Set(uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = ANAC->SVDCFG;
	tmpreg &= ~(ANAC_SVDCFG_SVDITVL_Msk);
	tmpreg |= (SetValue & ANAC_SVDCFG_SVDITVL_Msk);
	ANAC->SVDCFG = tmpreg;
}
/********************************
读SVD间歇使能间隔时间配置函数
功能:读SVD工作模式
输入：无
输出:间歇使能间隔时间状态位
********************************/
uint32_t ANAC_SVDCFG_SVDITVL_Get(void)
{
	return (ANAC->SVDCFG & ANAC_SVDCFG_SVDITVL_Msk);
}

