flyghost/OneOS-V2.1.0/drivers/hal/fm/FM33G0xx_HAL/FM33G0xx_HAL_Driver/Src/fm33g0xx_anac.c
/*********************************
SVD测试使能控制函数 
功能：SVD测试使能启停控制
输入: ENABLE 启动SVD测试使能
      DISABLE 停止SVD测试使能
输出: 无
*********************************/
void ANAC_SVDCON_SVDTE_Setable(FunState NewState)
{
	if (NewState == ENABLE)
	{
		ANAC->SVDCON |= (ANAC_SVDCON_SVDTE_Msk);
	}
	else
	{
		ANAC->SVDCON &= ~(ANAC_SVDCON_SVDTE_Msk);
	}
}
/*********************************
读SVD测试使能控制状态函数 
功能：读SVD测试使能控制状态
输入: 无
输出: ENABLE 启动SVD测试使能
      DISABLE 停止SVD测试使能
*********************************/
FunState ANAC_SVDCON_SVDTE_Getable(void)
{
	if (ANAC->SVDCON & (ANAC_SVDCON_SVDTE_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/*********************************
SVD使能控制函数 
功能：SVD使能启停控制
输入: ENABLE 启动SVD使能
      DISABLE 停止SVD使能
输出: 无
*********************************/
void ANAC_SVDCON_SVDEN_Setable(FunState NewState)
{
	if (NewState == ENABLE)
	{
		ANAC->SVDCON |= (ANAC_SVDCON_SVDEN_Msk);
	}
	else
	{
		ANAC->SVDCON &= ~(ANAC_SVDCON_SVDEN_Msk);
	}
}

/*********************************
读SVD使能控制状态函数 
功能：读SVD使能控制状态
输入: 无
输出: ENABLE 启动SVD使能
      DISABLE 停止SVD使能
*********************************/
FunState ANAC_SVDCON_SVDEN_Getable(void)
{
	if (ANAC->SVDCON & (ANAC_SVDCON_SVDEN_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}


/*********************************
读SVD电源检测输出制状态函数 
功能：读SVD电源检测输出状态
输入: 无
输出: SET   电源电压高于SVD当前阈值
      RESET 电源电压低于SVD当前阈值
*********************************/
FlagStatus ANAC_SVDSIF_SVDO_Chk(void)
{
	if (ANAC->SVDSIF & ANAC_SVDSIF_SVDO_Msk)
	{
		return SET;
	}
	else
	{
		return RESET;
	}
}

/*********************************
SVD电源跌落中断标志寄存器函数 
功能：电源跌落中断标志，电源电压跌落到SVD阈值之下时置位，软件写1清零
输入: 无
输出: 无
*********************************/
void ANAC_SVDSIF_PFF_Clr(void)
{
	ANAC->SVDSIF = ANAC_SVDSIF_PFF_Msk;
}
/*********************************
读SVD电源跌落中断标志寄存器状态函数 
功能：读SVD电源跌落中断标志状态
输入: 无
输出: SET   中断状态为1
      RESET  中断状态为0
*********************************/
FlagStatus ANAC_SVDSIF_PFF_Chk(void)
{
	if (ANAC->SVDSIF & ANAC_SVDSIF_PFF_Msk)
	{
		return SET;
	}
	else
	{
		return RESET;
	}
}

/*********************************
SVD电源恢复中断标志寄存器函数 
功能：电源恢复中断标志，电源电压上升到SVD阈值之上时置位，软件写1清零
输入: 无
输出: 无
*********************************/
void ANAC_SVDSIF_PRF_Clr(void)
{
	ANAC->SVDSIF = ANAC_SVDSIF_PRF_Msk;
}
/*********************************
读SVD电源恢复中断标志寄存器状态函数 
功能：读SVD电源恢复中断标志状态
输入: 无
输出: SET   中断状态为1
      RESET  中断状态为0
*********************************/
FlagStatus ANAC_SVDSIF_PRF_Chk(void)
{
	if (ANAC->SVDSIF & ANAC_SVDSIF_PRF_Msk)
	{
		return SET;
	}
	else
	{
		return RESET;
	}
}

/*********************************
读SVD内部滤波后的电压检测标志寄存器状态函数 
功能：读SVD内部滤波后的电压检测标志状态
输入: 无
输出: SET   不欠压
      RESET  欠压
*********************************/
FlagStatus ANAC_SVDSIF_SVDR_Chk(void)
{
	if (ANAC->SVDSIF & ANAC_SVDSIF_SVDR_Msk)
	{
		return SET;
	}
	else
	{
		return RESET;
	}
}

/*********************************
设置SVD基准输入电压函数
功能：设置SVD基准输入电压为0.7V、0.75V、0.8V三选一，默认为0.8V
输入: ANAC_SVDVOL_V0P7EN_Msk、ANAC_SVDVOL_V0P75EN_Msk、ANAC_SVDVOL_V0P8EN_Msk
输出: 无
*********************************/
void ANAC_SVDVOL_CFG(uint32_t SetValue)
{
  if(SetValue==ANAC_SVDVOL_V0P7EN_Msk)
  {
    ANAC->SVDVOL=ANAC_SVDVOL_V0P7EN_Msk;
  }
  else if(SetValue==ANAC_SVDVOL_V0P75EN_Msk)
  {
    ANAC->SVDVOL=ANAC_SVDVOL_V0P75EN_Msk;
  }
  else
  {
    ANAC->SVDVOL=ANAC_SVDVOL_V0P8EN_Msk;
  }
}

/********************************
读SVD参考电压选择寄存器
功能:读SVD参考电压
输入：无
输出: SVD参考电压
********************************/
uint32_t ANAC_SVDVOL_Get(void)
{
	return (ANAC->SVDVOL );
}

/*********************************
XTLF低频检测报警中断使能启动控制函数 
功能：XTLF低频检测报警中断启停控制
输入: ENABLE 启动XTLF低频检测报警中断
      DISABLE 停止XTLF低频检测报警中断
输出: 无
*********************************/
void ANAC_FDETIE_FDET_IE_Setable(FunState NewState)
{
	if (NewState == ENABLE)
	{
		ANAC->FDETIE |= (ANAC_FDETIE_FDET_IE_Msk);
	}
	else
	{
		ANAC->FDETIE &= ~(ANAC_FDETIE_FDET_IE_Msk);
	}
}
/*********************************
XTLF低频检测报警中断使能控制位状态获取函数 
功能：获取XTLF低频检测报警中断使能控制状态
输入:无
输出: ENABLE XTLF低频检测报警中断已启动
      DISABLE XTLF低频检测报警中断已停止
*********************************/
FunState ANAC_FDETIE_FDET_IE_Getable(void)
{
	if (ANAC->FDETIE & (ANAC_FDETIE_FDET_IE_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}


/*********************************
XTLF停振检测模块输出状态获取函数 
功能：获取XTLF停振检测模块输出状态
输入:无
输出: SET    XTLF未停振
      RESET  XTLF停振
*********************************/
FlagStatus ANAC_FDETIF_FDETO_Chk(void)
{
	if (ANAC->FDETIF & ANAC_FDETIF_FDETO_Msk)
	{
		return SET;
	}
	else
	{
		return RESET;
	}
}

/*********************************
XTLF停振检测中断标志寄存器函数 
功能：清XTLF停振检测中断标志
输入: 停振检测中断标志寄存器，XTLF停振时硬件异步置位，软件写1清零；只有在FDETO不为0的情况下才能够清除此寄存器
输出: 无
*********************************/
void ANAC_FDETIF_FDETIF_Clr(void)
{
	ANAC->FDETIF = ANAC_FDETIF_FDETIF_Msk;
}
/*********************************
XTLF停振检测中断标志获取函数 
功能：XTLF停振检测中断标志获取
输入:无
输出: SET   产生标志
      RESET 未产生标志
*********************************/
FlagStatus ANAC_FDETIF_FDETIF_Chk(void)
{
	if (ANAC->FDETIF & ANAC_FDETIF_FDETIF_Msk)
	{
		return SET;
	}
	else
	{
		return RESET;
	}
}
/*********************************
ADC中断使能控制函数 
功能：ADC中断启停控制
输入: ENABLE 启动高位计数器
      DISABLE 停止高位计数器
输出: 无
*********************************/
void ANAC_ADCCON_ADC_IE_Setable(FunState NewState)
{
	if (NewState == ENABLE)
	{
		ANAC->ADCCON |= (ANAC_ADCCON_ADC_IE_Msk);
	}
	else
	{
		ANAC->ADCCON &= ~(ANAC_ADCCON_ADC_IE_Msk);
	}
}
/*********************************
ADC中断使能状态获取函数 
功能：ADC中断使能状态
输入: 无
输出: ENABLE   ADC中断已启动
      DISABLE  ADC中断已停止
*********************************/
FunState ANAC_ADCCON_ADC_IE_Getable(void)
{
	if (ANAC->ADCCON & (ANAC_ADCCON_ADC_IE_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/*********************************
ADC外部电压通道选择函数 
功能：ADC外部电压通道选择
输入: ANAC_ADCCON_ADC_VANA_EN_PTAT：ADC用作温度传感器
      ANAC_ADCCON_ADC_VANA_EN_VOLTAGE：ADC用于测量外部电压
输出: 无
*********************************/
void ANAC_ADCCON_ADC_VANA_EN_Set(uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = ANAC->ADCCON;
	tmpreg &= ~(ANAC_ADCCON_ADC_VANA_EN_Msk);
	tmpreg |= (SetValue & ANAC_ADCCON_ADC_VANA_EN_Msk);
	ANAC->ADCCON = tmpreg;
}
/*********************************
ADC外部电压通道获取配置函数 
功能：获取ADC外部电压通道模式
输入: 无
输出: 通道寄存器值
*********************************/
uint32_t ANAC_ADCCON_ADC_VANA_EN_Get(void)
{
	return (ANAC->ADCCON & ANAC_ADCCON_ADC_VANA_EN_Msk);
}

