flyghost/OneOS-V2.1.0/drivers/hal/fm/FM33G0xx_HAL/FM33G0xx_HAL_Driver/Src/fm33g0xx_anac.c
/*********************************
ADC使能信号函数 
功能：ADC使能
输入:  ENABLE   ADC已启动
       DISABLE  ADC已停止
输出: 无
*********************************/
void ANAC_ADCCON_ADC_EN_Setable(FunState NewState)
{
	if (NewState == ENABLE)
	{
		ANAC->ADCCON |= (ANAC_ADCCON_ADC_EN_Msk);
	}
	else
	{
		ANAC->ADCCON &= ~(ANAC_ADCCON_ADC_EN_Msk);
	}
}
/*********************************
ADC使能状态获取函数 
功能：获取ADC是否使能
输入: 无
输出:  ENABLE   ADC已启动
       DISABLE  ADC已停止
*********************************/
FunState ANAC_ADCCON_ADC_EN_Getable(void)
{
	if (ANAC->ADCCON & (ANAC_ADCCON_ADC_EN_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/*********************************
ADCTRIM值配置函数 
功能：ADCTRIM值配置
输入: ADC TRIM值
输出:  无
*********************************/
void ANAC_ADCTRIM_Write(uint32_t SetValue)
{
	ANAC->ADCTRIM = (SetValue & ANAC_ADCTRIM_ADC_TRIM_Msk);
}
/*********************************
获取ADCTRIM值函数 
功能：获取ADCTRIM值
输入: 无
输出:  ADC TRIM值
*********************************/
uint32_t ANAC_ADCTRIM_Read(void)
{
	return (ANAC->ADCTRIM & ANAC_ADCTRIM_ADC_TRIM_Msk);
}

/*********************************
获取ADC测量值函数 
功能：获取ADC测量输出值
输入: 无
输出:  ADC测量输出值
*********************************/
uint32_t ANAC_ADCDATA_Read(void)
{
	return (ANAC->ADCDATA & ANAC_ADCDATA_ADC_DATA_Msk);
}

/*********************************
ADC转换完成输出标志函数 
功能：ADC转换完成输出标志，硬件置位，ADC关闭才会清0
输入: 无
输出:  SET     ADC_DONE置位
       RESET   ADC_DONE为0
*********************************/
FlagStatus ANAC_ADCIF_ADC_DONE_Chk(void)
{
	if (ANAC->ADCIF & ANAC_ADCIF_ADC_DONE_Msk)
	{
		return SET;
	}
	else
	{
		return RESET;
	}
}

/*********************************
ADC转换完成中断标志函数 
功能：ADC转换完成中断标志，ADC转换完成中断标志，硬件置位，软件写1清零，写0无效
输入: 无
输出:  无
*********************************/
void ANAC_ADCIF_ADC_IF_Clr(void)
{
	ANAC->ADCIF = ANAC_ADCIF_ADC_IF_Msk;
}

FlagStatus ANAC_ADCIF_ADC_IF_Chk(void)
{
	if (ANAC->ADCIF & ANAC_ADCIF_ADC_IF_Msk)
	{
		return SET;
	}
	else
	{
		return RESET;
	}
}

/*********************************
ADC通道buffer使能函数 
功能：ADC通道buffer是否使能
输入: ENABLE   启动buffer
      DISABLE  停止buffer
输出: 无
*********************************/
void ANAC_ADCINSEL_BUFEN_Setable(FunState NewState)
{
	if (NewState == ENABLE)
	{
		ANAC->ADCINSEL |= (ANAC_ADCINSEL_BUFEN_Msk);
	}
	else
	{
		ANAC->ADCINSEL &= ~(ANAC_ADCINSEL_BUFEN_Msk);
	}
}

/*********************************
ADC通道buffer使能状态标志获取函数 
功能：获取ADC通道buffer使能状态标志
输入: 无
输出: ENABLE   启动buffer
      DISABLE  停止buffer
*********************************/
FunState ANAC_ADCINSEL_BUFEN_Getable(void)
{
	if (ANAC->ADCINSEL & (ANAC_ADCINSEL_BUFEN_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/*********************************
ADC通道buffer Bypass 配置函数 
功能：配置ADC通道buffer是否Bypass，使用ADC测量外部信号输入时，不要Bypass Buffer，使用ADC测量电源电压时，必须将此位置1
输入: ENABLE   启动Bypass
      DISABLE  停止Bypass
输出: 无
*********************************/
void ANAC_ADCINSEL_BUFBYP_Setable(FunState NewState)
{
	if (NewState == ENABLE)
	{
		ANAC->ADCINSEL |= (ANAC_ADCINSEL_BUFBYP_Msk);
	}
	else
	{
		ANAC->ADCINSEL &= ~(ANAC_ADCINSEL_BUFBYP_Msk);
	}
}

/*********************************
ADC通道buffer Bypass状态获取函数 
功能：获取ADC通道buffer Bypass状态
输入: 无
输出: ENABLE   启动buffer Bypass
      DISABLE  停止buffer Bypass
*********************************/
FunState ANAC_ADCINSEL_BUFBYP_Getable(void)
{
	if (ANAC->ADCINSEL & (ANAC_ADCINSEL_BUFBYP_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}


/*********************************
ADC通道选择函数 
功能：ADC输入通道选择，
输入: ADC_IN1到ADC_IN8   VDD
输出: 无
*********************************/
void ANAC_ADCINSEL_BUFSEL_Set(uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = ANAC->ADCINSEL;
	tmpreg &= ~(ANAC_ADCINSEL_BUFSEL_Msk);
	tmpreg |= (SetValue & ANAC_ADCINSEL_BUFSEL_Msk);
	ANAC->ADCINSEL = tmpreg;
}


/*********************************
ADC通道选择获取函数 
功能：获取ADC
输入: 无
输出: 选取的ADC通道
*********************************/
uint32_t ANAC_ADCINSEL_BUFSEL_Get(void)
{
	return (ANAC->ADCINSEL & ANAC_ADCINSEL_BUFSEL_Msk);
}

/*********************************
TRNG随机数启动控制函数 
功能：RNG使能寄存器，软件写1启动，完成随机数产生后自动清零
输入: ENABLE   启动随机数
      DISABLE  停止随机数
输出: 无
*********************************/
void ANAC_TRNGCON_TRNGEN_Setable(FunState NewState)
{
	if (NewState == ENABLE)
	{
		ANAC->TRNGCON |= (ANAC_TRNGCON_TRNGEN_Msk);
	}
	else
	{
		ANAC->TRNGCON &= ~(ANAC_TRNGCON_TRNGEN_Msk);
	}
}
/*********************************
TRNG随机数启动控制状态函数 
功能：获取RNG状态
输入: 无
输出: ENABLE   启动随机数
      DISABLE  停止随机数
*********************************/
FunState ANAC_TRNGCON_TRNGEN_Getable(void)
{
	if (ANAC->TRNGCON & (ANAC_TRNGCON_TRNGEN_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/*********************************
比较器1输出状态获取函数 
功能：获取比较器输出高低
输入: 无
输出: SET   比较器输出高
      RESET 比较器输出低
*********************************/
FlagStatus ANAC_COMP1CR_CMP1O_Chk(void)
{
	if (ANAC->COMP1CR & ANAC_COMP1CR_CMP1O_Msk)
	{
		return SET;
	}
	else
	{
		return RESET;
	}
}

/*********************************
比较器1正极输入选择函数 
功能：比较器1正极输入选择
输入: PF6 PF1 PG2 PG3
输出: 无
*********************************/
void ANAC_COMP1CR_V1PSEL_Set(uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = ANAC->COMP1CR;
	tmpreg &= ~(ANAC_COMP1CR_V1PSEL_Msk);
	tmpreg |= (SetValue & ANAC_COMP1CR_V1PSEL_Msk);
	ANAC->COMP1CR = tmpreg;
}
/*********************************
比较器1正极输入源获取函数 
功能：获取比较器1正极输入源
输入: 无
输出: PF6 PF1 PG2 PG3
*********************************/
uint32_t ANAC_COMP1CR_V1PSEL_Get(void)
{
	return (ANAC->COMP1CR & ANAC_COMP1CR_V1PSEL_Msk);
}

/*********************************
比较器1负极输入选择函数 
功能：比较器1负极输入选择
输入: PF5 PF0   Vref_0.8V  Vref/2_0.4V
输出: 无
*********************************/
void ANAC_COMP1CR_V1NSEL_Set(uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = ANAC->COMP1CR;
	tmpreg &= ~(ANAC_COMP1CR_V1NSEL_Msk);
	tmpreg |= (SetValue & ANAC_COMP1CR_V1NSEL_Msk);
	ANAC->COMP1CR = tmpreg;
}
/*********************************
比较器1负极输入源获取函数 
功能：获取比较器1负极输入源
输入: 无
输出: PF5 PF0   Vref_0.8V  Vref/2_0.4V
*********************************/
uint32_t ANAC_COMP1CR_V1NSEL_Get(void)
{
	return (ANAC->COMP1CR & ANAC_COMP1CR_V1NSEL_Msk);
}

/*********************************
比较器1使能控制函数 
功能：比较器1使能
输入: ENABLE   启动比较器1
      DISABLE  停止比较器1
输出: 无
*********************************/
void ANAC_COMP1CR_CMP1EN_Setable(FunState NewState)
{
	if (NewState == ENABLE)
	{
		ANAC->COMP1CR |= (ANAC_COMP1CR_CMP1EN_Msk);
	}
	else
	{
		ANAC->COMP1CR &= ~(ANAC_COMP1CR_CMP1EN_Msk);
	}
}
/*********************************
比较器1状态获取函数 
功能：获取比较器1状态
输入: 无
输出: ENABLE   启动比较器1
      DISABLE  停止比较器1
*********************************/
FunState ANAC_COMP1CR_CMP1EN_Getable(void)
{
	if (ANAC->COMP1CR & (ANAC_COMP1CR_CMP1EN_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}


