flyghost/OneOS-V2.1.0/drivers/hal/fm/FM33G0xx_HAL/FM33G0xx_HAL_Driver/Src/fm33g0xx_anac.c
/*********************************
比较器2输出状态获取函数 
功能：获取比较器输出高低
输入: 无
输出: SET   比较器输出高
      RESET 比较器输出低
*********************************/
FlagStatus ANAC_COMP2CR_CMP2O_Chk(void)
{
	if (ANAC->COMP2CR & ANAC_COMP2CR_CMP2O_Msk)
	{
		return SET;
	}
	else
	{
		return RESET;
	}
}

/*********************************
比较器2正极输入选择函数 
功能：比较器2正极输入选择
输入: PC15 PE4
输出: 无
*********************************/
void ANAC_COMP2CR_V2PSEL_Set(uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = ANAC->COMP2CR;
	tmpreg &= ~(ANAC_COMP2CR_V2PSEL_Msk);
	tmpreg |= (SetValue & ANAC_COMP2CR_V2PSEL_Msk);
	ANAC->COMP2CR = tmpreg;
}
/*********************************
比较器2正极输入源获取函数 
功能：获取比较器1正极输入源
输入: 无
输出: PC15 PE4
*********************************/
uint32_t ANAC_COMP2CR_V2PSEL_Get(void)
{
	return (ANAC->COMP2CR & ANAC_COMP2CR_V2PSEL_Msk);
}

/*********************************
比较器2负极输入选择函数 
功能：比较器2负极输入选择
输入: PC14 PE3   Vref_0.8V  Vref/2_0.4V
输出: 无
*********************************/
void ANAC_COMP2CR_V2NSEL_Set(uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = ANAC->COMP2CR;
	tmpreg &= ~(ANAC_COMP2CR_V2NSEL_Msk);
	tmpreg |= (SetValue & ANAC_COMP2CR_V2NSEL_Msk);
	ANAC->COMP2CR = tmpreg;
}
/*********************************
比较器2负极输入源获取函数 
功能：获取比较器1负极输入源
输入: 无
输出: PC14 PE3   Vref_0.8V  Vref/2_0.4V
*********************************/
uint32_t ANAC_COMP2CR_V2NSEL_Get(void)
{
	return (ANAC->COMP2CR & ANAC_COMP2CR_V2NSEL_Msk);
}

/*********************************
比较器2使能控制函数 
功能：比较器2使能
输入: ENABLE   启动比较器2
      DISABLE  停止比较器2
输出: 无
*********************************/
void ANAC_COMP2CR_CMP2EN_Setable(FunState NewState)
{
	if (NewState == ENABLE)
	{
		ANAC->COMP2CR |= (ANAC_COMP2CR_CMP2EN_Msk);
	}
	else
	{
		ANAC->COMP2CR &= ~(ANAC_COMP2CR_CMP2EN_Msk);
	}
}
/*********************************
比较器2状态获取函数 
功能：获取比较器2状态
输入: 无
输出: ENABLE   启动比较器2
      DISABLE  停止比较器2
*********************************/
FunState ANAC_COMP2CR_CMP2EN_Getable(void)
{
	if (ANAC->COMP2CR & (ANAC_COMP2CR_CMP2EN_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/*********************************
比较器2数字滤波配置函数 
功能：比较器2数字滤波开启控制
输入: ENABLE   启动数字滤波
      DISABLE  停止数字滤波
输出: 无
*********************************/
void ANAC_COMPICR_CMP2DF_Setable(FunState NewState)
{
	if (NewState == ENABLE)
	{
		ANAC->COMPICR |= (ANAC_COMPICR_CMP2DF_Msk);
	}
	else
	{
		ANAC->COMPICR &= ~(ANAC_COMPICR_CMP2DF_Msk);
	}
}
/*********************************
比较器2数字滤波状态获取函数 
功能：获取比较器2数字滤波状态
输入: 无
输出: ENABLE   启动比较器2数字滤波
      DISABLE  停止比较器2数字滤波
*********************************/
FunState ANAC_COMPICR_CMP2DF_Getable(void)
{
	if (ANAC->COMPICR & (ANAC_COMPICR_CMP2DF_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/*********************************
比较器1数字滤波配置函数 
功能：比较器1数字滤波开启控制
输入: ENABLE   启动数字滤波
      DISABLE  停止数字滤波
输出: 无
*********************************/
void ANAC_COMPICR_CMP1DF_Setable(FunState NewState)
{
	if (NewState == ENABLE)
	{
		ANAC->COMPICR |= (ANAC_COMPICR_CMP1DF_Msk);
	}
	else
	{
		ANAC->COMPICR &= ~(ANAC_COMPICR_CMP1DF_Msk);
	}
}
/*********************************
比较器1数字滤波状态获取函数 
功能：获取比较器1数字滤波状态
输入: 无
输出: ENABLE   启动比较器1数字滤波
      DISABLE  停止比较器1数字滤波
*********************************/
FunState ANAC_COMPICR_CMP1DF_Getable(void)
{
	if (ANAC->COMPICR & (ANAC_COMPICR_CMP1DF_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/*********************************
比较器Buffer Bypass控制函数 
功能：比较器Buffer Bypass选择
输入: ENABLE   启动比较器Buffer Bypass
      DISABLE  停止比较器Buffer Bypass
输出: 无
*********************************/
void ANAC_COMPICR_BUFBYP_Setable(FunState NewState)
{
	if (NewState == ENABLE)
	{
		ANAC->COMPICR |= (ANAC_COMPICR_BUFBYP_Msk);
	}
	else
	{
		ANAC->COMPICR &= ~(ANAC_COMPICR_BUFBYP_Msk);
	}
}
/*********************************
比较器Buffer Bypass状态获取函数 
功能：获取比较器Buffer Bypass状态
输入: 无
输出: ENABLE   比较器Buffer Bypass使能
      DISABLE  比较器Buffer Bypass禁止
*********************************/
FunState ANAC_COMPICR_BUFBYP_Getable(void)
{
	if (ANAC->COMPICR & (ANAC_COMPICR_BUFBYP_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/*********************************
比较器Buffer 控制函数 
功能：比较器Buffer 选择
输入: ENABLE   启动比较器Buffer 
      DISABLE  停止比较器Buffer 
输出: 无
*********************************/
void ANAC_COMPICR_BUFENB_Setable(FunState NewState)
{
	if (NewState == ENABLE)
	{
		ANAC->COMPICR &= ~(ANAC_COMPICR_BUFENB_Msk);
	}
	else
	{
		ANAC->COMPICR |= (ANAC_COMPICR_BUFENB_Msk);
	}
}
/*********************************
比较器Buffer 状态获取函数 
功能：获取比较器Buffer状态
输入: 无
输出: ENABLE   比较器Buffer启动
      DISABLE  比较器Buffer波停止
*********************************/
FunState ANAC_COMPICR_BUFENB_Getable(void)
{
	if (ANAC->COMPICR & (ANAC_COMPICR_BUFENB_Msk))
	{
		return DISABLE;
	}
	else
	{
		return ENABLE;
	}
}


/*********************************
比较器2中断源选择函数 
功能：比较器2中断源选择bit[5:4]
输入: ANAC_COMPICR_CMP2SEL_OUTBOTH：比较器2输出上升或下降沿产生中断
      ANAC_COMPICR_CMP2SEL_OUTRISE：比较器2输出上升沿产生中断
      ANAC_COMPICR_CMP2SEL_OUTFALL：比较器2输出下降沿产生中断
输出: 无
*********************************/
void ANAC_COMPICR_CMP2SEL_Set(uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = ANAC->COMPICR;
	tmpreg &= ~(ANAC_COMPICR_CMP2SEL_Msk);
	tmpreg |= (SetValue & ANAC_COMPICR_CMP2SEL_Msk);
	ANAC->COMPICR = tmpreg;
}
/*********************************
比较器2中断源获取函数 
功能：获取比较器2中断源bit[5:4]
输入: 无
输出: ANAC_COMPICR_CMP2SEL_OUTBOTH：比较器2输出上升或下降沿产生中断
      ANAC_COMPICR_CMP2SEL_OUTRISE：比较器2输出上升沿产生中断
      ANAC_COMPICR_CMP2SEL_OUTFALL：比较器2输出下降沿产生中断
*********************************/
uint32_t ANAC_COMPICR_CMP2SEL_Get(void)
{
	return (ANAC->COMPICR & ANAC_COMPICR_CMP2SEL_Msk);
}

/*********************************
比较器1中断源选择函数 
功能：比较器1中断源选择bit[3:2]
输入: ANAC_COMPICR_CMP1SEL_OUTBOTH：比较器1输出上升或下降沿产生中断
      ANAC_COMPICR_CMP1SEL_OUTRISE：比较器1输出上升沿产生中断
      ANAC_COMPICR_CMP1SEL_OUTFALL：比较器1输出下降沿产生中断
输出: 无
*********************************/
void ANAC_COMPICR_CMP1SEL_Set(uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = ANAC->COMPICR;
	tmpreg &= ~(ANAC_COMPICR_CMP1SEL_Msk);
	tmpreg |= (SetValue & ANAC_COMPICR_CMP1SEL_Msk);
	ANAC->COMPICR = tmpreg;
}
/*********************************
比较器1中断源获取函数 
功能：获取比较器1中断源bit[3:2]
输入: 无
输出: ANAC_COMPICR_CMP1SEL_OUTBOTH：比较器1输出上升或下降沿产生中断
      ANAC_COMPICR_CMP1SEL_OUTRISE：比较器1输出上升沿产生中断
      ANAC_COMPICR_CMP1SEL_OUTFALL：比较器1输出下降沿产生中断
*********************************/
uint32_t ANAC_COMPICR_CMP1SEL_Get(void)
{
	return (ANAC->COMPICR & ANAC_COMPICR_CMP1SEL_Msk);
}

