flyghost/OneOS-V2.1.0/drivers/hal/fm/FM33G0xx_HAL/FM33G0xx_HAL_Driver/Src/fm33g0xx_anac.c
/*********************************
比较器2中断使能控制函数 
功能：比较器2中断控制开关
输入: ENABLE   启动比较器2中断
      DISABLE  停止比较器2中断波
输出: 无
*********************************/
void ANAC_COMPICR_CMP2IE_Setable(FunState NewState)
{
	if (NewState == ENABLE)
	{
		ANAC->COMPICR |= (ANAC_COMPICR_CMP2IE_Msk);
	}
	else
	{
		ANAC->COMPICR &= ~(ANAC_COMPICR_CMP2IE_Msk);
	}
}

/*********************************
比较器2中断使能状态函数 
功能：获取比较器2中断控制状态
输入: 无
输出: ENABLE   比较器2中断启动
      DISABLE  比较器2中断波停止
*********************************/
FunState ANAC_COMPICR_CMP2IE_Getable(void)
{
	if (ANAC->COMPICR & (ANAC_COMPICR_CMP2IE_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/*********************************
比较器1中断使能控制函数 
功能：比较器1中断控制开关
输入: ENABLE   启动比较器1中断
      DISABLE  停止比较器1中断波
输出: 无
*********************************/
void ANAC_COMPICR_CMP1IE_Setable(FunState NewState)
{
	if (NewState == ENABLE)
	{
		ANAC->COMPICR |= (ANAC_COMPICR_CMP1IE_Msk);
	}
	else
	{
		ANAC->COMPICR &= ~(ANAC_COMPICR_CMP1IE_Msk);
	}
}
/*********************************
比较器1中断使能状态函数 
功能：获取比较器1中断控制状态
输入: 无
输出: ENABLE   比较器1中断启动
      DISABLE  比较器1中断波停止
*********************************/
FunState ANAC_COMPICR_CMP1IE_Getable(void)
{
	if (ANAC->COMPICR & (ANAC_COMPICR_CMP1IE_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/*********************************
比较器2中断标志控制函数 
功能：比较器2中断标志控制
输入: 硬件置位，软件写1清零
输出: 无
*********************************/
void ANAC_COMPIF_CMP2IF_Clr(void)
{
	ANAC->COMPIF = ANAC_COMPIF_CMP2IF_Msk;
}
/*********************************
比较器2中断标志状态函数 
功能：获取比较器2中断标志状态
输入: 无
输出: SET    比较器2产生中断标志
      RESET  比较器2未产生中断标志
*********************************/
FlagStatus ANAC_COMPIF_CMP2IF_Chk(void)
{
	if (ANAC->COMPIF & ANAC_COMPIF_CMP2IF_Msk)
	{
		return SET;
	}
	else
	{
		return RESET;
	}
}

/*********************************
比较器1中断标志控制函数 
功能：比较器1中断标志控制
输入: 硬件置位，软件写1清零
输出: 无
*********************************/
void ANAC_COMPIF_CMP1IF_Clr(void)
{
	ANAC->COMPIF = ANAC_COMPIF_CMP1IF_Msk;
}
/*********************************
比较器1中断标志状态函数 
功能：获取比较器1中断标志状态
输入: 无
输出: SET    比较器1产生中断标志
      RESET  比较器1未产生中断标志
*********************************/
FlagStatus ANAC_COMPIF_CMP1IF_Chk(void)
{
	if (ANAC->COMPIF & ANAC_COMPIF_CMP1IF_Msk)
	{
		return SET;
	}
	else
	{
		return RESET;
	}
}

void ANAC_Deinit(void)
{
	ANAC->PDRCON = 0x00000003;
	ANAC->BORCON = 0x00000002;
	ANAC->SVDCFG = 0x00000008;
	ANAC->SVDCON = 0x00000000;
	//ANAC->SVDSIF = ;
	ANAC->FDETIE = 0x00000000;
	//ANAC->FDETIF = ;
	ANAC->ADCCON = 0x00000000;
	ANAC->ADCTRIM = 0x00000000;
	//ANAC->ADCDATA = ;
	//ANAC->ADCIF = ;
	ANAC->ADCINSEL = 0x00000000;
	ANAC->TRNGCON = 0x00000000;
	ANAC->COMP1CR = 0x00000000;
	ANAC->COMP2CR = 0x00000000;
	ANAC->COMPICR = 0x00000040;
	//ANAC->COMPIF = ;
}
//Code_End



/*********************************
SVD初始化配置函数 
功能：SVD初始化配置
输入: ANAC_SVD_InitTypeDef* para，结构体函数中配置工作模式、阈值、数字滤波等功能
输出: 无
*********************************/
void ANAC_SVD_Init(ANAC_SVD_InitTypeDef* para)
{
	ANAC_SVDCFG_SVDMOD_Set(para->SVDMOD);	//SVD工作模式选择
	ANAC_SVDCFG_SVDITVL_Set(para->SVDITVL);	//SVD间歇使能间隔设置
	ANAC_SVDCFG_SVDLVL_Set(para->SVDLVL);	//SVD报警阈值设置
	ANAC_SVDCFG_DFEN_Setable(para->DFEN);	//SVD数字滤波设置（SVDMODE=1时必须置1）
	ANAC_SVDCFG_PFIE_Setable(para->PFIE);	//SVD电源跌落中断设置
	ANAC_SVDCFG_PRIE_Setable(para->PRIE);	//SVD电源恢复中断设置
	ANAC_SVDCON_SVDTE_Setable(DISABLE);	//关闭测试功能
	ANAC_SVDCON_SVDEN_Setable(para->SVDEN);	//SVD使能设置
}

/*********************************
ADC初始化配置函数 
功能：ADC初始化配置
输入: ANAC_ADC_InitTypeDef* para，结构体函数中配置ADCTRIM、内外部通道、buff等功能
输出: 无
*********************************/
void ANAC_ADC_Init(ANAC_ADC_InitTypeDef* para)
{
	ANAC_ADCTRIM_Write(para->ADC_TRIM);				//<等效参考电压调校寄存器
	ANAC_ADCCON_ADC_VANA_EN_Set(para->ADC_VANA_EN);	//<内部通道、外部通道选择
	ANAC_ADCINSEL_BUFSEL_Set(para->BUFSEL);			//<ADC输入通道选择
	ANAC_ADCINSEL_BUFBYP_Setable(para->BUFBYP);		//<ADC输入Buffer Bypass，ADC输入Buffer Bypass，使用ADC测量外部信号输入时，关闭bypass， 使用ADC测量内部信号时，必须将此位置1（bypass）
	ANAC_ADCINSEL_BUFEN_Setable(para->BUFEN);		//<ADC输入通道Buffer使能，常开即可
	ANAC_ADCCON_ADC_IE_Setable(para->ADC_IE);		//<ADC中断使能
	ANAC_ADCCON_ADC_EN_Setable(para->ADC_EN);		//<ADC使能
}

/*********************************
ADC测量通道配置函数 
功能：ADC通道配置
输入: CH_PTAT  CH_VDD  CH_IN1-8
输出: 无
*********************************/
void ANAC_ADC_Channel_SetEx(uint8_t ChSel_def)
{
	switch( ChSel_def )
	{
		case CH_PTAT_Auto://温度传感器通道,用于自动温补
			ANAC_ADCCON_ADC_VANA_EN_Set(ANAC_ADCCON_ADC_VANA_EN_PTAT);	//测温	
			ANAC_ADCTRIM_Write(const_adc_TrimT_Auto);						//配置参考电压
			ANAC_ADCINSEL_BUFBYP_Setable(ENABLE);	//内部信号测量，bypassbuffer
			ANAC_ADCINSEL_BUFEN_Setable(ENABLE);	//
			break;
    
    case CH_PTAT://温度传感器通道(除自动温补)
			ANAC_ADCCON_ADC_VANA_EN_Set(ANAC_ADCCON_ADC_VANA_EN_PTAT);	//测温	
			ANAC_ADCTRIM_Write(const_adc_TrimT);						//配置参考电压
			ANAC_ADCINSEL_BUFBYP_Setable(ENABLE);	//内部信号测量，bypassbuffer
			ANAC_ADCINSEL_BUFEN_Setable(ENABLE);	//
			break;
    
		case CH_VDD://电源VDD通道
			ANAC_ADCCON_ADC_VANA_EN_Set(ANAC_ADCCON_ADC_VANA_EN_VOLTAGE);	//测VDD电压，注意ADC量程为4.5V（2.2mV*0x7FF）,高于4.5V的电压返回0x7FF
			ANAC_ADCTRIM_Write(const_adc_TrimV);							//配置参考电压
			ANAC_ADCINSEL_BUFBYP_Setable(ENABLE);		//内部输入
			ANAC_ADCINSEL_BUFEN_Setable(ENABLE);		//电压
			ANAC_ADCINSEL_BUFSEL_Set(ANAC_ADCINSEL_BUFSEL_VDD);//vdd
			break;
		
		case CH_IN1://外部输入通道
		case CH_IN2:
		case CH_IN3:
		case CH_IN4:
		case CH_IN5:
		case CH_IN6:
		case CH_IN7:
		case CH_IN8:
			ANAC_ADCCON_ADC_VANA_EN_Set(ANAC_ADCCON_ADC_VANA_EN_VOLTAGE);	//测电压，输入电压不可高于芯片VDD，注意ADC量程为4.5V（2.2mV*0x7FF）,高于4.5V的电压返回0x7FF
			ANAC_ADCTRIM_Write(const_adc_TrimV);							//配置参考电压
			ANAC_ADCINSEL_BUFBYP_Setable(DISABLE);	//外部信号测量，关闭bypassbuffer
			ANAC_ADCINSEL_BUFEN_Setable(ENABLE);	//打开bufferen
			ANAC_ADCINSEL_BUFSEL_Set((ANAC_ADCINSEL_BUFSEL_ADC_IN1 + (ChSel_def - CH_IN1)));//输入通道选择
			break;
		
		default:
			break;
	}
}


/*ADC 电压计算函数
	输入：AD值、电源电压
	输出：电压@mV 
*/
//被测电压低于100mV后测试结果不太准确
//被测电压超过4.4V后测试结果不太准确
//被测电压不可超过电源电压
//被测电压不可超过4.5V
/*********************************
ADC电压计算函数 
功能：计算ADC测量电压值
输入: ADC值、电源电压
输出: 电压值
*********************************/
uint32_t ANAC_ADC_VoltageCalc(uint32_t fADCData,uint8_t Vdd)
{
	uint32_t fVolt = 0;
	uint32_t AdcTrim = 0;
	AdcTrim = ANAC_ADCTRIM_Read();

	if((AdcTrim == 0x0ff)&&(const_adc_Slope_0FF > 8000) && (const_adc_Slope_0FF < 9600))//有adctrim——0ff的成测数据
	{
			//使用成测数据	
			//ADC值换算为电压值
			if(fADCData <= 8)
				fVolt = 0;
			else if(fADCData <= 12)
				fVolt = (fADCData-8)*20;
			else if(fADCData <= 37)
				fVolt = fADCData*const_adc_Slope_0FF/1000;
			else if(fADCData <= 125)
				fVolt = (fADCData*98*const_adc_Slope_0FF/100000);
			else
				fVolt = fADCData*const_adc_Slope_0FF/1000+const_adc_Offset_0FF/100;	
	}
	else if((AdcTrim == 0x1ff)&&(const_adc_Slope_1FF > 4000) && (const_adc_Slope_1FF < 4800))//有adctrim——1ff的成测数据
	{
			//使用成测数据	
			//ADC值换算为电压值
			if(fADCData <= 15)
				fVolt = 0;
			else if(fADCData <= 25)
				fVolt = (fADCData-15)*10;
			else if(fADCData <= 75)
				fVolt = fADCData*const_adc_Slope_1FF/1000;
			else if(fADCData <= 250)
				fVolt = (fADCData*98*const_adc_Slope_1FF/100000);
			else
				fVolt = fADCData*const_adc_Slope_1FF/1000+const_adc_Offset_1FF/100;	
	}
	else
	{
		if(AdcTrim == 0x1ff)
		{
			fADCData*=2;//adc值扩大2倍
		}
		else if(AdcTrim == 0x0ff)
		{
			fADCData*=4;//adc值扩大4倍
		}
		else
		{
			
