flyghost/OneOS-V2.1.0/drivers/hal/fm/FM33G0xx_HAL/FM33G0xx_HAL_Driver/Src/fm33g0xx_anac.c
		}			
		if( (const_adc_Slope > 2000) && (const_adc_Slope < 2400) )
		{
					//使用成测数据	
					//ADC值换算为电压值
					if(fADCData <= 30)
						fVolt = 0;
					else if(fADCData <= 50)
						fVolt = (fADCData-30)*5;
					else if(fADCData <= 150)
						fVolt = fADCData*const_adc_Slope/1000;
					else if(fADCData <= 500)
						fVolt = (fADCData*98*const_adc_Slope/100000);
					else
						fVolt = fADCData*const_adc_Slope/1000+const_adc_Offset/100;	
		}
		else
		{
			//调试临时使用
			fVolt = (fADCData - 10)*2174/1000;
		}	
	}
  if(Vdd==3)
  {
    fVolt=(fVolt*102/100);
  }
	
	return fVolt;
}

/*ADC 温度计算函数
	输入：AD值	 float型（方便处理平均值）
	输入：电源电压 uint08型 仅支持3/5V，用于做电压补偿
	输出：温度@℃ float型
*/
/*********************************
ADC温度计算函数 
功能：计算ADC测量温度值
输入: ADC值、电源电压
输出: 温度值
*********************************/
float ANAC_ADC_TemperatureCalc(float fADCData ,uint8_t Vdd)
{
	float fTestADC, fTestT, fFa;
	float fTemperature;
		
	if( const_temp_TestA == 0x1E )
	{
		//使用温度定标数据
		fTestT = const_temp_TestA+(float)(const_temp_TestB/0x80)*0.5;
		if( Vdd == 3 )
		{
			fTestADC = const_adc_Test  - const_T_Offset3V*const_TmpsH;
		}
		else
		{			
			fTestADC = const_adc_Test  - const_T_Offset5V*const_TmpsH;
		}
	}
	else
	{
		//调试临时使用
		fTestT = 30;
		fTestADC = 1500;
	}
	
	if( fADCData > (fTestADC-25) )	//高温
		fFa = const_TmpsH;
	else
		fFa = const_TmpsL;

	fTemperature = (fADCData - fTestADC)/fFa + fTestT;
	
	return fTemperature;
}

/*ADC 温度计算函数
	输入：AD值	  uint32_t型(计算速度快)
	输入：电源电压 uint08型 仅支持3/5V，用于做电压补偿
	输出：温度@℃ uint32_t型
*/
/*********************************
ADC温度计算函数 
功能：计算ADC测量温度值
输入: ADC值、电源电压
输出: 温度值
*********************************/
int32_t ANAC_ADC_TemperatureCalcInt(uint32_t ADCData ,uint8_t Vdd)
{
	uint32_t TestADC;
	int32_t TestT,Fa;
	int32_t Temperature;
		
	if( const_temp_TestA == 0x1E )
	{
		//使用温度定标数据
		TestT = const_temp_TestA;
		if( Vdd == 3 )
		{
			TestADC = (int32_t)const_adc_Test  - (int32_t)const_T_Offset3V*(const_TmpsH*10000)/10000;
		}
		else
		{			
			TestADC = (int32_t)const_adc_Test  - (int32_t)const_T_Offset5V*(const_TmpsH*10000)/10000;
		}
	}
	else
	{
		//调试临时使用
		TestT = 30;
		TestADC = 1500;
	}
	
	if( ADCData > (TestADC-25) )	//高温
		Fa = const_TmpsH*10000;
	else
		Fa = const_TmpsL*10000;

	Temperature = ((int32_t)(ADCData - TestADC)*10000)/Fa + TestT;
	
	return Temperature;
}
/*********************************
比较器初始化配置函数 
功能：配置比较器参数
输入: ANAC_COMPx_InitTypeDef* para  比较器1或2 寄存器正极输入、负极输入、中断使能等参数
输出: 无
*********************************/
void ANAC_COMPx_Init(ANAC_COMPx_InitTypeDef* para)
{
	if(para->COMPx == 1)//比较器1
	{
		ANAC_COMP1CR_V1PSEL_Set(para->VxPSEL);		//比较器x正极输入选择
		ANAC_COMP1CR_V1NSEL_Set(para->VxNSEL);		//比较器x负极输入选择
		ANAC_COMPICR_CMP1SEL_Set(para->CMPxSEL);	//比较器x中断源选择
		ANAC_COMPICR_CMP1IE_Setable(para->CMPxIE);	//较器x中断使能
		ANAC_COMPICR_CMP1DF_Setable(para->CMPxDF);	//比较器x数字滤波使能
		ANAC_COMP1CR_CMP1EN_Setable(para->CMPxEN);	//比较器x使能
	}
	else		//比较器2
	{
		ANAC_COMP2CR_V2PSEL_Set(para->VxPSEL);		//比较器x正极输入选择
		ANAC_COMP2CR_V2NSEL_Set(para->VxNSEL);		//比较器x负极输入选择
		ANAC_COMPICR_CMP2SEL_Set(para->CMPxSEL);	//比较器x中断源选择
		ANAC_COMPICR_CMP2IE_Setable(para->CMPxIE);	//较器x中断使能
		ANAC_COMPICR_CMP2DF_Setable(para->CMPxDF);	//比较器x数字滤波使能
		ANAC_COMP2CR_CMP2EN_Setable(para->CMPxEN);	//比较器x使能	
	}
}


/******END OF FILE****/



